; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob65) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate10)
	(at pallet1 depot1)
	(clear crate7)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate9)
	(at pallet4 distributor1)
	(clear crate1)
	(at pallet5 distributor2)
	(clear pallet5)
	(at truck0 depot2)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 388)
	(at truck1 depot1)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 285)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor0)
	(available hoist6)
	(at hoist7 distributor2)
	(available hoist7)
	(at hoist8 distributor0)
	(available hoist8)
	(at hoist9 distributor2)
	(available hoist9)
	(at hoist10 depot0)
	(available hoist10)
	(at hoist11 depot0)
	(available hoist11)
	(at crate0 depot0)
	(on crate0 pallet0)
	(= (weight crate0) 42)
	(at crate1 distributor1)
	(on crate1 pallet4)
	(= (weight crate1) 86)
	(at crate2 depot1)
	(on crate2 pallet1)
	(= (weight crate2) 80)
	(at crate3 distributor0)
	(on crate3 pallet3)
	(= (weight crate3) 98)
	(at crate4 depot0)
	(on crate4 crate0)
	(= (weight crate4) 51)
	(at crate5 depot0)
	(on crate5 crate4)
	(= (weight crate5) 7)
	(at crate6 distributor0)
	(on crate6 crate3)
	(= (weight crate6) 38)
	(at crate7 depot1)
	(on crate7 crate2)
	(= (weight crate7) 49)
	(at crate8 depot0)
	(on crate8 crate5)
	(= (weight crate8) 67)
	(at crate9 distributor0)
	(on crate9 crate6)
	(= (weight crate9) 2)
	(at crate10 depot0)
	(on crate10 crate8)
	(= (weight crate10) 7)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet2)
		(on crate1 pallet5)
		(on crate2 crate3)
		(on crate3 pallet3)
		(on crate4 pallet4)
		(on crate5 crate8)
		(on crate6 pallet1)
		(on crate8 crate0)
		(on crate10 crate1)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist8 crate9 crate6 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist8) (on crate9 crate6)
   added: (lifting hoist8 crate9) (clear crate6)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 9
2. (lift hoist1 crate7 crate2 depot1)
   deleted: (at crate7 depot1) (clear crate7) (available hoist1) (on crate7 crate2)
   added: (lifting hoist1 crate7) (clear crate2)
   changed: (fuel-cost) from 1 to 2
   goals met: 1 of 9
3. (load hoist1 crate7 truck1 depot1)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 49
   goals met: 1 of 9
4. (lift hoist6 crate6 crate3 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist6) (on crate6 crate3)
   added: (lifting hoist6 crate6) (clear crate3)
   changed: (fuel-cost) from 2 to 3
   goals met: 1 of 9
5. (lift hoist1 crate2 pallet1 depot1)
   deleted: (at crate2 depot1) (clear crate2) (available hoist1) (on crate2 pallet1)
   added: (lifting hoist1 crate2) (clear pallet1)
   changed: (fuel-cost) from 3 to 4
   goals met: 1 of 9
6. (load hoist1 crate2 truck1 depot1)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck1) (available hoist1)
   changed: (current_load truck1) from 49 to 129
   goals met: 1 of 9
7. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 4 to 14
   goals met: 1 of 9
8. (load hoist6 crate6 truck1 distributor0)
   deleted: (lifting hoist6 crate6)
   added: (in crate6 truck1) (available hoist6)
   changed: (current_load truck1) from 129 to 167
   goals met: 1 of 9
9. (unload hoist3 crate2 truck1 distributor0)
   deleted: (in crate2 truck1) (available hoist3)
   added: (lifting hoist3 crate2)
   changed: (current_load truck1) from 167 to 87
   goals met: 1 of 9
10. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   changed: (fuel-cost) from 14 to 24
   goals met: 1 of 9
11. (unload hoist1 crate6 truck1 depot1)
   deleted: (in crate6 truck1) (available hoist1)
   added: (lifting hoist1 crate6)
   changed: (current_load truck1) from 87 to 49
   goals met: 1 of 9
12. (drop hoist3 crate2 crate3 distributor0)
   deleted: (lifting hoist3 crate2) (clear crate3)
   added: (available hoist3) (at crate2 distributor0) (clear crate2) (on crate2 crate3)
   goals met: 2 of 9
13. (drop hoist1 crate6 pallet1 depot1)
   deleted: (lifting hoist1 crate6) (clear pallet1)
   added: (available hoist1) (at crate6 depot1) (clear crate6) (on crate6 pallet1)
   goals met: 3 of 9
14. (lift hoist11 crate10 crate8 depot0)
   deleted: (at crate10 depot0) (clear crate10) (available hoist11) (on crate10 crate8)
   added: (lifting hoist11 crate10) (clear crate8)
   changed: (fuel-cost) from 24 to 25
   goals met: 3 of 9
15. (lift hoist0 crate8 crate5 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist0) (on crate8 crate5)
   added: (lifting hoist0 crate8) (clear crate5)
   changed: (fuel-cost) from 25 to 26
   goals met: 3 of 9
16. (lift hoist10 crate5 crate4 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist10) (on crate5 crate4)
   added: (lifting hoist10 crate5) (clear crate4)
   changed: (fuel-cost) from 26 to 27
   goals met: 3 of 9
17. (drop hoist0 crate8 crate4 depot0)
   deleted: (lifting hoist0 crate8) (clear crate4)
   added: (available hoist0) (at crate8 depot0) (clear crate8) (on crate8 crate4)
   goals met: 3 of 9
18. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 27 to 37
   goals met: 3 of 9
19. (load hoist11 crate10 truck0 depot0)
   deleted: (lifting hoist11 crate10)
   added: (in crate10 truck0) (available hoist11)
   changed: (current_load truck0) from 0 to 7
   goals met: 3 of 9
20. (lift hoist11 crate8 crate4 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist11) (on crate8 crate4)
   added: (lifting hoist11 crate8) (clear crate4)
   changed: (fuel-cost) from 37 to 38
   goals met: 3 of 9
21. (lift hoist0 crate4 crate0 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate0)
   added: (lifting hoist0 crate4) (clear crate0)
   changed: (fuel-cost) from 38 to 39
   goals met: 3 of 9
22. (load hoist0 crate4 truck0 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck0) (available hoist0)
   changed: (current_load truck0) from 7 to 58
   goals met: 3 of 9
23. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 39 to 49
   goals met: 3 of 9
24. (lift hoist4 crate1 pallet4 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist4) (on crate1 pallet4)
   added: (lifting hoist4 crate1) (clear pallet4)
   changed: (fuel-cost) from 49 to 50
   goals met: 3 of 9
25. (load hoist4 crate1 truck0 distributor1)
   deleted: (lifting hoist4 crate1)
   added: (in crate1 truck0) (available hoist4)
   changed: (current_load truck0) from 58 to 144
   goals met: 3 of 9
26. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 50 to 60
   goals met: 3 of 9
27. (unload hoist5 crate1 truck0 distributor2)
   deleted: (in crate1 truck0) (available hoist5)
   added: (lifting hoist5 crate1)
   changed: (current_load truck0) from 144 to 58
   goals met: 3 of 9
28. (drop hoist5 crate1 pallet5 distributor2)
   deleted: (lifting hoist5 crate1) (clear pallet5)
   added: (available hoist5) (at crate1 distributor2) (clear crate1) (on crate1 pallet5)
   goals met: 4 of 9
29. (unload hoist5 crate10 truck0 distributor2)
   deleted: (in crate10 truck0) (available hoist5)
   added: (lifting hoist5 crate10)
   changed: (current_load truck0) from 58 to 51
   goals met: 4 of 9
30. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 60 to 70
   goals met: 4 of 9
31. (drop hoist5 crate10 crate1 distributor2)
   deleted: (lifting hoist5 crate10) (clear crate1)
   added: (available hoist5) (at crate10 distributor2) (clear crate10) (on crate10 crate1)
   goals met: 5 of 9
32. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 70 to 80
   goals met: 5 of 9
33. (unload hoist4 crate4 truck0 distributor1)
   deleted: (in crate4 truck0) (available hoist4)
   added: (lifting hoist4 crate4)
   changed: (current_load truck0) from 51 to 0
   goals met: 5 of 9
34. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 80 to 90
   goals met: 5 of 9
35. (drop hoist4 crate4 pallet4 distributor1)
   deleted: (lifting hoist4 crate4) (clear pallet4)
   added: (available hoist4) (at crate4 distributor1) (clear crate4) (on crate4 pallet4)
   goals met: 6 of 9
36. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet0)
   added: (lifting hoist0 crate0) (clear pallet0)
   changed: (fuel-cost) from 90 to 91
   goals met: 6 of 9
37. (load hoist0 crate0 truck0 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 42
   goals met: 6 of 9
38. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 91 to 101
   goals met: 6 of 9
39. (unload hoist2 crate0 truck0 depot2)
   deleted: (in crate0 truck0) (available hoist2)
   added: (lifting hoist2 crate0)
   changed: (current_load truck0) from 42 to 0
   goals met: 6 of 9
40. (drop hoist2 crate0 pallet2 depot2)
   deleted: (lifting hoist2 crate0) (clear pallet2)
   added: (available hoist2) (at crate0 depot2) (clear crate0) (on crate0 pallet2)
   goals met: 7 of 9
41. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 101 to 111
   goals met: 7 of 9
42. (load hoist11 crate8 truck0 depot0)
   deleted: (lifting hoist11 crate8)
   added: (in crate8 truck0) (available hoist11)
   changed: (current_load truck0) from 0 to 67
   goals met: 7 of 9
43. (load hoist10 crate5 truck0 depot0)
   deleted: (lifting hoist10 crate5)
   added: (in crate5 truck0) (available hoist10)
   changed: (current_load truck0) from 67 to 74
   goals met: 7 of 9
44. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 111 to 121
   goals met: 7 of 9
45. (unload hoist2 crate8 truck0 depot2)
   deleted: (in crate8 truck0) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck0) from 74 to 7
   goals met: 7 of 9
46. (drop hoist2 crate8 crate0 depot2)
   deleted: (lifting hoist2 crate8) (clear crate0)
   added: (available hoist2) (at crate8 depot2) (clear crate8) (on crate8 crate0)
   goals met: 8 of 9
47. (unload hoist2 crate5 truck0 depot2)
   deleted: (in crate5 truck0) (available hoist2)
   added: (lifting hoist2 crate5)
   changed: (current_load truck0) from 7 to 0
   goals met: 8 of 9
48. (drop hoist2 crate5 crate8 depot2)
   deleted: (lifting hoist2 crate5) (clear crate8)
   added: (available hoist2) (at crate5 depot2) (clear crate5) (on crate5 crate8)
   goals met: 9 of 9
